In [113]:
import pandas as pd

names=['bob','anna','jhon','elton','hacket']
age=[25,22,31,14,40]

print(names)
print(age)

['bob', 'anna', 'jhon', 'elton', 'hacket']
[25, 22, 31, 14, 40]

In [114]:
data=list(zip(names,age))

In [115]:
data

[('bob', 25), ('anna', 22), ('jhon', 31), ('elton', 14), ('hacket', 40)]

In [116]:
df=pd.DataFrame(data)

In [117]:
df

        0   1
0     bob  25
1    anna  22
2    jhon  31
3   elton  14
4  hacket  40

In [118]:
df[0]

0       bob
1      anna
2      jhon
3     elton
4    hacket
Name: 0, dtype: object

In [119]:
df=pd.DataFrame(data,columns=['name','age'])

In [120]:
df

     name  age
0     bob   25
1    anna   22
2    jhon   31
3   elton   14
4  hacket   40

In [121]:
df['name']

0       bob
1      anna
2      jhon
3     elton
4    hacket
Name: name, dtype: object

In [122]:
df['age'][0]

25

In [123]:
df.loc[0]

name    bob
age      25
Name: 0, dtype: object

In [124]:
df.loc[0:4]

     name  age
0     bob   25
1    anna   22
2    jhon   31
3   elton   14
4  hacket   40

In [125]:
df.iloc[0:4]

    name  age
0    bob   25
1   anna   22
2   jhon   31
3  elton   14

In [126]:
df['fail']=1

In [127]:
df

     name  age  fail
0     bob   25     1
1    anna   22     1
2    jhon   31     1
3   elton   14     1
4  hacket   40     1

In [128]:
df['fail']+=1

In [129]:
df

     name  age  fail
0     bob   25     2
1    anna   22     2
2    jhon   31     2
3   elton   14     2
4  hacket   40     2

In [130]:
df.drop('fail',axis=1)

     name  age
0     bob   25
1    anna   22
2    jhon   31
3   elton   14
4  hacket   40

In [131]:
#axis=0 rows
#axis=0 col

In [132]:
df

     name  age  fail
0     bob   25     2
1    anna   22     2
2    jhon   31     2
3   elton   14     2
4  hacket   40     2

In [133]:
df.drop('fail',axis=1,inplace=True)

In [134]:
df

     name  age
0     bob   25
1    anna   22
2    jhon   31
3   elton   14
4  hacket   40

In [135]:
df[df['age']>20]

     name  age
0     bob   25
1    anna   22
2    jhon   31
4  hacket   40

In [136]:
df[df['age']>20]['age']

0    25
1    22
2    31
4    40
Name: age, dtype: int64

In [137]:
df['age'][0]=50

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [138]:
df

     name  age
0     bob   50
1    anna   22
2    jhon   31
3   elton   14
4  hacket   40

In [139]:
df['name'][0]='hisham'

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [140]:
df

     name  age
0  hisham   50
1    anna   22
2    jhon   31
3   elton   14
4  hacket   40

In [141]:
data2={'name':['bob','anna','jhon','elton','hacket'],
'age':[25,22,31,14,40]}

In [142]:
df=pd.DataFrame(data2)

In [143]:
df

     name  age
0     bob   25
1    anna   22
2    jhon   31
3   elton   14
4  hacket   40

In [144]:
#df.to_csv('births.csv',index=False,header=None)
df.to_csv('births.csv',index=False)

In [145]:
df=pd.read_csv('births.csv')
#df=pd.read_csv('births.csv',header=None)

In [146]:
df

     name  age
0     bob   25
1    anna   22
2    jhon   31
3   elton   14
4  hacket   40

In [147]:
df.keys()

Index(['name', 'age'], dtype='object')